#include <stdio.h>
#include <math.h>                   //для вылічэння модулю.
#define EPSILON 1.0E-07F            //заданне маленькага ліку-мяжы для дакладнасці.
#define TWOPI 6.28318530718628318   //для адкідвання перыяду функцыі.

int main(void)
{

    double X[15];     //заданне масіву з 15 значэнняў Х.
    double cos_value;
    double p;
    double y;
    double z;
                

    printf("Enter 15 X values\n");

    for (int i = 0; i < 15; i++) //цыкл для ўводу 15 значэнняў Х з клавіятуры.
    {
        printf("\t%d X value: \n", i + 1);
        scanf("%lf", &X[i]);
        printf("\n");

        while(X[i]>TWOPI)       //адкідванне перыяду функцыі (два пі).
        {
            X[i]=X[i]-TWOPI;
        }
        

    }
    
    for (int i = 0; i < 15; i++)  //цыкл падліку 15 значэнняў косінусу.
    {
         cos_value = 1.0;  //пач. знач. косінусу.
         p = 1.0;         // пач. знач. для дробу.
         y = 1.0;         //пач. знач. назоўніку.
         z = -X[i] * X[i]; //пач. знач. лічніку.

        

        while(y <= 100 && fabs(p)>EPSILON) //спыняем вылічэнні калі дроб не больш зададзенага эпсілон па абсалютнай велічыні ці ў раскладзе радка больш за 50 складаемых.
         {
            p = p * z / (y * (y+1)); //прамежкавае значэнне дробу.
            cos_value+=p; //змяненне значэння косінусу.
            y = y + 2; //прамежкавае значэнне назоўніка дробу.
         }
        
                printf("   ----------------------------------cos( X_%d )---------------------------------------------\n",i+1); //канчатковы вывад знач. косінуса.
                printf_s("%d) calculation               cosX = %.5lf\n\n\n", i+1, cos_value);    
           

    }





       
    
}           