#include <stdio.h>
#include "header.h"
void input(int arr[])                              //вызначэнне функцыі ўводу.
{
    printf("Enter an array: ");          //MAIN MAIN
    for(int i=0; i<N; i++)  scanf("%d", &arr[i]);   //цыкл для таго, каб злічыць N элементаў масіву з клавіятуры. 
}    
        
        
    



void output(int arr[])                      //вызначэнне функцыі вываду значэння адстартаванага масіву.
{
    printf("Sorted array:\n {");         //MAIN MAIN MAIN
    for (int i = 0; i < N; i++)             //цыкл для вываду на экран усіх элементаў адсартаванага масіву.
    {
        printf("%4d",arr[i]);
    }
    printf("}");
}

void sort(int arr[])                        //вызначэнне функцыі сартыроўкі масіву.
{
    int swap;                               //дэкларацыя зменнай для спынення цыклу, калі масіў ужо адсартаваны.
    int temp;                               //дэкларацыя зменнай для перастаноўкі значэнняў элементаў масіву.
    for (int i = 0; i < N-1; i++)           //цыкл для сартыроўкі масіву.
    {
        
        swap=0;                             //значэнне зменнай для спынення цыклу.
        for (int j = 0; j < N-i-1; j++)     //цыкл для перастаноўкі элементаў масіву.
        {   
            if(arr[j]>arr[j+1])             //перастаноўка элементаў масіву.
            {
                temp=arr[j];                //значэнне элементу масіву заносіцца ў зменную часовай памяці.
                arr[j]=arr[j+1];            //
                arr[j+1]=temp;              //
                swap=1;                     //змена значэння зменнай для спынення цыклу.
            }
        }
        if (swap==0)                        //спыненне сартыроўкі.
        {
            break;
        }
        
        
    }
}